import pytest
import allure
from pages.main_page import MainPage

class TestFaq:
    faq_data = [(0, "Сколько это стоит? И как оплатить?", "Сутки — 400 рублей. Оплата курьеру — наличными или картой."),
            (1, "Хочу сразу несколько самокатов! Так можно?", "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."),
            (2, "Как рассчитывается время аренды?", "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."),
            (3, "Можно ли заказать самокат прямо на сегодня?", "Только начиная с завтрашнего дня. Но скоро станем расторопнее."),
            (4, "Можно ли продлить заказ или вернуть самокат раньше?", "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."), 
            (5, "Вы привозите зарядку вместе с самокатом?", "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."),
            (6, "Можно ли отменить заказ?", "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."), 
            (7, "Я жизу за МКАДом, привезёте?", "Да, обязательно. Всем самокатов! И Москве, и Московской области.")]

    @allure.title("Проверка раскрытия вопросов в разделе 'Вопросы о важном'")
    @pytest.mark.parametrize("index, question_text, expected_answer", faq_data)
    def test_faq_accordion(self, driver, index, question_text, expected_answer):
        main_page = MainPage(driver)
        main_page.open()
        main_page.accept_cookies()

        main_page.click_faq_question(index)

        actual_answer = main_page.get_faq_answer(index)

        assert expected_answer in actual_answer, f"Ответ для вопроса '{question_text}' не совпал!"